Autodesk.Navisworks.Api.FileSaveEventArgs
Event arguments used for Autodesk.Navisworks.Api.Document SaveFile related events

Autodesk.Navisworks.Api.FileSaveEventArgs.FileName
Gets the name of the file that is being saved to

Autodesk.Navisworks.Api.FileSaveEventArgs.IsPublish
Gets whether the save is a publish

Autodesk.Navisworks.Api.FileSaveEventArgs.SaveComplete
Gets whether the save has completed successfully